Revit 2027 API
ParameterTypeId.ViewSolarstudyLightingPresetIndex Property
 "Lighting presets combo"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewSolarstudyLightingPresetIndex { get; }
Public Shared ReadOnly Property ViewSolarstudyLightingPresetIndex As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewSolarstudyLightingPresetIndex {
	ForgeTypeId^ get ();
}
static member ViewSolarstudyLightingPresetIndex : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace